import os

import dotenv  # type: ignore


dotenv.load_dotenv()
TG_API_URL = 'https://api.telegram.org'
BOT_TOKEN = os.getenv('BOT_TOKEN', '')

greeting_sticker = 'CAADAgADTgUAAsiuFQMWhq_Msw3cOgI'
trash = (
    "пизда",
    "хуй",
)
hate_speech = (
    "пидор",
    "пидр",
    "нигер",
    "нигга",
)
corgi = (
    "корги",
    "коржик",
)
shibe = (
    "сиба",
    "сибу",
    "шиба",
    "сибушка",
    "шибушка",
    "шибой",
)
random_dog = (
  "песель",
  "пёсель",
  "собака",
  "пёс",
  "пёса",
  "догич",
  "догислав",
  "дог",
  "собак",
  "собакен",
  "собакич",
  "догислав",
  "собакевич",
  "пепс",
  "догос",
  "доггос",
  "доггер",
  "догич",
  "собачка",
  "собаня",
  "собачька",
)
toy = (
    "той",
)
pug = (
    "пуг",
    "мопс",
)
terrier = (
    "терьер",
)
net = (
  "минет",
  "омлет",
  "паштет",
  "паштет",
  "менталитет",
  "авиабилет",
  "интернет",
  "бронежилет",
  "банкет",
  "суверенитет",
  "туалет",
  "портрет",
  "фальцет",
  "жакет",
  "прокурор въебал пять лет",
  "СОДОМИТА ОТВЕТ",
  "СОДОМИТА ОТВЕТ",
  "СОДОМИТА ОТВЕТ",
  "СОДОМИТА ОТВЕТ",
  "СОДОМИТА ОТВЕТ",
  "СОДОМИТА ОТВЕТ",
  "хуй зажало в турникет",
)
trista = (
  "хуйни в ссылку декабриста",
  "благодарите программиста",
  "абстрагируйся от суеты, достигнув с космосом единства",
  "метни бутылку в альпиниста",
)
